from flask import Flask, request, render_template, redirect, url_for
import random
app = Flask(__name__)

food_list = {
    "โคเจ" : [
        ("ข้าวหมูกรอบจิ้มแจ่ว","55"),
        ("ข้าวแกงกะหรี่หมูกรอบ","55"),
        ("ข้าวไก่ทอดโคเจ","45"),
        ("ข้าวทอดซอสเกาหลี","45"),
        ("ข้าวไก่เทอริยากิ","45"),
        ("ข้าวหมูผัดซอส","45"),
    ],
    "ข้าวมันไก่ป้าวิไล" : [
        ("ข้าวมันไก่ต้ม","40"),
        ("ข้าวมันไก่ทอด","40"),
        ("ข้าวมันไก่ต้ม+ไก่ทอด","50"),
        ("ข้าวหมกไก่","40"),
        ("ก๋วยจั๊บ","40"),
    ],
    "ครัวสิริ" : [
        ("บะหมี่เกี๊ยวหมูแดง","40"),
        ("บะหมี่เกี๊ยวหมูกรอบ","45"),
        ("บะหมี่เกี๊ยวหมูแดงหมูกรอบ","50"),
        ("บะหมี่ไก่แซ่บ","40"),
        ("บะหมี่หมูย่างแซ่บ","40"),
        ("ข้าวหมูแดงหมูกรอบ","50"),
        ("ข้าวหมูกรอบ","45"),
        ("ข้าวหมูแดง","45"),
        ("ข้าวขาหมู","45"),
        ("ข้าวหน้าไก่ย่าง","45"),
    ],
    "ริว ก๋วยเตี๋ยวไก่ตุ๋น รสเด็ด" : [
        ("ก๋วยเตี๋ยวไก่ตุ๋น","45"),
        ("ก๋วยเตี๋ยวหมูตุ๋น","50"),
        ("ข้าวหน้าไก่ตุ๋น","45"),
        ("ข้าวหน้าหมูตุ๋น","45"),
        ("ก๋วยเตี๋ยวไก่ตุ๋นมะระ","45")
    ],
    "บูน สเต็กเฮ้าส์" : [
        ("สเต็กไก่","69"),
        ("สเต็กไก่สไปซี่","69"),
        ("สเต็กไก่พริกไทยดำ","69"),
        ("สเต็กพอร์คชอป","99"),
        ("สเต็กหมูพริกไทยดำ","79"),
        ("สเต็กหมูสไปซี่","79"),
        ("สเต็กปลาทอด","69"),
        ("สเต็กเนื้อสันนอก","119"),
        ("สปาเกตตี้โบโลเนสไก่","49"),
        ("สปาเกตตี้ครีมไข่กุ้ง","69"),
        ("สปาเกตตี้เบคอนผัดพริกแห้ง","69"),
        ("สปาเกตตี้ขี้เมาทะเล","69"),
        ("ข้าวไก่คาราเกะ","55"),
        ("ข้าวไก่ย่างสไปซี่","50"),
        ("พิซซ่าเวียดนาม","59"),
        ("เฟนรฟราย","40"),
        ("นักเก็ต","40"),
        ("ข้าวไข่ข้น","40"),
        ("ข้าวไข่เจียว","40"),
        ("ข้ามคอหมูย่างน้ำจิ้มแจ่ว","55"),
    ],
    "วาสนา ก๋วยเตี๋ยว" : [
        ("ก๋วยเตี๋ยวเนื้อตุ๋น","45"),
        ("ก๋วยเตี๋ยวหมูตุ๋น","45"),
        ("ต้มเลือดหมู","40"),
    ],
    "ครัวพี่ช้าง" : [
        ("ข้าวผัดหมู","40"),
        ("ข้าวผัดไก่","40"),
        ("ข้าวผัดกุ้ง","45"),
        ("ข้าวผัดปลาหมึก","45"),
        ("ข้าวผัดเบคอน","45"),
        ("ข้าวราดผัดกะเพราหมู","40"),
        ("ข้าวราดผัดกะเพราไก่","40"),
        ("ข้าวราดผัดกะเพราหมูกรอบ","45"),
        ("ข้าวราดผัดกะเพราเบคอน","45"),
        ("ข้าวราดผัดกะเพราไก่","45"),
        ("ข้าวราดผัดกะเพรากุ้ง","45"),
        ("ข้าวราดผัดกะเพราปลาหมึก","45"),
        ("ข้าวราดผัดผงกะหรี่หมู","45"),
        ("ข้าวราดผัดผงกะหรี่ไก่","45"),
        ("ข้าวราดผัดผงกะหรี่กุ้ง","50"),
        ("ข้าวราดผัดผงกะหรี่ปลาหมึก","50"),
        ("ข้าวราดผัดพริกแกงหมู","40"),
        ("ข้าวราดผัดพริกแกงไก่","40"),
        ("ข้าวราดผัดพริกแกงหมูกรอบ","45"),
        ("ข้าวราดผัดพริกแกงเบคอน","45"),
        ("ข้าวราดผัดพริกแกงกุ้ง","45"),
        ("ข้าวราดผัดพริกแกงปลาหมึก","45"),
        ("ข้าวราดผัดคะน้า","45"),
        ("ข้าวราดผัดกระเทียม","45"),
        ("ข้าวราดผัดน้ำมันหอย","45"),
        ("มะกะโรนีผัดซอส","45"),
        ("สปาเก็ตตี้ผัดซอส","45"),
        ("สปาเก็ตตี้ผัดขี้เมา","45"),
        ("ราดหน้า","45"),
        ("มาม่าผัด","45"),
        ("ผัดซีอิ๊ว","45"),
        ("สุกี้","45"),
    ],
}

@app.route('/', methods=['POST', 'GET'])
def search() :
    if request.method == "POST" :
        name = request.form['restaurant'].strip()
        
        if name in food_list :
            return redirect(url_for('result', restaurant = name))
        elif name == '' :
            return redirect(url_for('random_result'))
        else :
            return render_template('search.html', error = "Restaurant not found!")
    
    return render_template('search.html')

@app.route('/result/<restaurant>')
def result(restaurant) :
    
    selected = random.choices(food_list[restaurant])
    food = selected[0][0]
    price = selected[0][1]
    
    return render_template('result.html',restaurant=restaurant, food=food, price=price)

@app.route('/random_result')
def random_result() :
    
    restaurant = random.choices(list(food_list.keys()))[0]
    selected = random.choices(food_list[restaurant])
    food = selected[0][0]
    price = selected[0][1]
    
    return render_template('result.html',restaurant=restaurant, food=food, price=price)

if __name__ == '__main__' :
    app.run(host='0.0.0.0', port=5000)
